---
kind: method
id: M:Autodesk.Revit.UI.DoubleClickOptions.GetDoubleClickOptions
source: html/b55cdbb8-1885-34c6-f30d-e688bf0f37ca.htm
---
# Autodesk.Revit.UI.DoubleClickOptions.GetDoubleClickOptions Method

Returns the current user's DoubleClickOptions.

## Syntax (C#)
```csharp
public static DoubleClickOptions GetDoubleClickOptions()
```

## Returns
The DoubleClickOptions for the current user.